import Layout from "../../components/layout/layout"

const Partnership = () => {
    return (
        <Layout>
        <div>
            <div className={`mb-8`}>Как стать автором контента</div>
            <div>СHILL - первая независимая платформа для web-контента с прозрачной монетизацией. <br/> <br/> Пользователь платит 6 рублей за просмотр любого эпизода. После вычета налогов и транзакционных сборов доход делится в пропорции 50%/50% между правообладателем и платформой. 
            Вы также можете разместить свой контент в бесплатной зоне CHILL по рекламной модели. 
            Если у вас есть только пилот веб-сериала и вы хотите найти инвестора, то мы также готовы его разместить в специальной зоне.</div>
        </div>
        </Layout>
    )
}

export default Partnership