let comments = [
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },

    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },

    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },

    {
        comment: "Хорошая версия, но мне ближе другая.",
        film: "«Здравствуйте, я робот»",
        username: "Виталий Иванович",
        userImage: "",
    },
]

export default comments