const doramas = [
    {
        name: "В яблочко! Парни - лучники",
        description: "Хон Шин А — яркая и амбициозная девушка. Она рисует, причём очень даже неплохо. На данный момент девушка весь свой талант направляет на создание вебтунов, поэтому становиться членом команды по стрельбе из лука, в которой кстати говоря, одни парни",
        image: "dorama",
        languages: ["en","ko","ru"],
        tags: [{
            name:"#дорамы",
            color:"#36A4C9",
            genre: "Дорамы"
        },
        {
            name:"#драма",
            color:"#A036C9",
            genre: "Драмы"
        }
    ],
        comments: 30,
        score: 7.8
    },
    {
        name: "В яблочко! Парни - лучники",
        description: "Хон Шин А — яркая и амбициозная девушка. Она рисует, причём очень даже неплохо. На данный момент девушка весь свой талант направляет на создание вебтунов, поэтому становиться членом команды по стрельбе из лука, в которой кстати говоря, одни парни",
        image: "dorama",
        languages: ["en","ko","ru"],
        tags: [{
            name:"#дорамы",
            color:"#36A4C9",
            genre: "Дорамы"
        },
        {
            name:"#драма",
            color:"#A036C9",
            genre: "Драмы"
        }
    ],
        comments: 30,
        score: 7.8
    },
    {
        name: "В яблочко! Парни - лучники",
        description: "Хон Шин А — яркая и амбициозная девушка. Она рисует, причём очень даже неплохо. На данный момент девушка весь свой талант направляет на создание вебтунов, поэтому становиться членом команды по стрельбе из лука, в которой кстати говоря, одни парни",
        image: "dorama",
        languages: ["en","ko","ru"],
        tags: [{
            name:"#дорамы",
            color:"#36A4C9",
            genre: "Дорамы"
        },
        {
            name:"#драма",
            color:"#A036C9",
            genre: "Драмы"
        }
    ],
        comments: 30,
        score: 7.8
    },
    {
        name: "В яблочко! Парни - лучники",
        description: "Хон Шин А — яркая и амбициозная девушка. Она рисует, причём очень даже неплохо. На данный момент девушка весь свой талант направляет на создание вебтунов, поэтому становиться членом команды по стрельбе из лука, в которой кстати говоря, одни парни",
        image: "dorama",
        languages: ["en","ko","ru"],
        tags: [{
            name:"#дорамы",
            color:"#36A4C9",
            genre: "Дорамы"
        },
        {
            name:"#драма",
            color:"#A036C9",
            genre: "Драмы"
        }
    ],
        comments: 30,
        score: 7.8
    },
    {
        name: "В яблочко! Парни - лучники",
        description: "Хон Шин А — яркая и амбициозная девушка. Она рисует, причём очень даже неплохо. На данный момент девушка весь свой талант направляет на создание вебтунов, поэтому становиться членом команды по стрельбе из лука, в которой кстати говоря, одни парни",
        image: "dorama",
        languages: ["en","ko","ru"],
        tags: [{
            name:"#дорамы",
            color:"#36A4C9",
            genre: "Дорамы"
        },
        {
            name:"#драма",
            color:"#A036C9",
            genre: "Драмы"
        }
    ],
        comments: 30,
        score: 7.8
    },
    {
        name: "В яблочко! Парни - лучники",
        description: "Хон Шин А — яркая и амбициозная девушка. Она рисует, причём очень даже неплохо. На данный момент девушка весь свой талант направляет на создание вебтунов, поэтому становиться членом команды по стрельбе из лука, в которой кстати говоря, одни парни",
        image: "dorama",
        languages: ["en","ko","ru"],
        tags: [{
            name:"#дорамы",
            color:"#36A4C9",
            genre: "Дорамы"
        },
        {
            name:"#драма",
            color:"#A036C9",
            genre: "Драмы"
        }
    ],
        comments: 30,
        score: 7.8
    },
]

export default doramas